# 결측치
- 결측값
- missing value
- NaN, Na, Null
- 알수 없는 값, 알려지지 않은 값

In [1]:
import pandas as pd
import numpy as np
data = {
    'city' : ['서울','경기도','제주','부산'],
    'total1' : [1258358,35162,26272,3416],
    'total2' : [12600,35100,26200,77006]
    
}
data_frame = pd.DataFrame(data)
data_frame

  city   total1  total2
0   서울  1258358   12600
1  경기도    35162   35100
2   제주    26272   26200
3   부산     3416   77006

In [2]:
data_frame.dtypes

city      object
total1     int64
total2     int64
dtype: object

In [3]:
data_frame.loc[1 , 'total1'] = np.nan

In [4]:
data_frame

  city     total1  total2
0   서울  1258358.0   12600
1  경기도        NaN   35100
2   제주    26272.0   26200
3   부산     3416.0   77006

In [7]:
# 결측치 확인 하는 작업 entries 값과 각 컬럼의 non-null 과 비교해요
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city    4 non-null      object
 1   total1  3 non-null      float64
 2   total2  4 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

## isnull ? isna()

In [8]:
data_frame.isnull()

    city  total1  total2
0  False   False   False
1  False    True   False
2  False   False   False
3  False   False   False

### 특정 컬럼에서 결측치 확인

In [13]:
data_frame[data_frame.total1.isnull()]
data_frame[data_frame.total1.isna()]
data_frame[data_frame[total1].isna()]
data_frame[data_frame[total1].isnull()]

  city  total1  total2
1  경기도     NaN   35100

### 결측치로 원하는 값 결정
- series도 가능해요

In [16]:
data_frame.fillna(0)
data_frame.fillna('결측치')

  city     total1  total2
0   서울  1258358.0   12600
1  경기도        결측치   35100
2   제주    26272.0   26200
3   부산     3416.0   77006

### 결측치가 있는 행, 열을 지워요
- 모든 행이 결측치만 삭제해요

In [17]:
data_frame.dropna()

  city     total1  total2
0   서울  1258358.0   12600
2   제주    26272.0   26200
3   부산     3416.0   77006

In [18]:
data_frame.dropna(axis=1)

  city  total2
0   서울   12600
1  경기도   35100
2   제주   26200
3   부산   77006

In [19]:
#모든 값이 결측치인 행 추가
# 마지막 행

In [22]:
data_frame.loc[len(data_frame)] = np.nan
data_frame

  city     total1   total2   4
0   서울  1258358.0  12600.0 NaN
1  경기도        NaN  35100.0 NaN
2   제주    26272.0  26200.0 NaN
3   부산     3416.0  77006.0 NaN
4  NaN        NaN      NaN NaN
5  NaN        NaN      NaN NaN

In [26]:
#모든 결측치 삭제 #모든 값이 결측치를 지운다
data_frame.dropna(how ='all')

  city     total1   total2   4
0   서울  1258358.0  12600.0 NaN
1  경기도        NaN  35100.0 NaN
2   제주    26272.0  26200.0 NaN
3   부산     3416.0  77006.0 NaN

In [25]:
help(data_frame.dropna)

Help on method dropna in module pandas.core.frame:

dropna(*, axis: 'Axis' = 0, how: 'AnyAll | NoDefault' = <no_default>, thresh: 'int | NoDefault' = <no_default>, subset: 'IndexLabel' = None, inplace: 'bool' = False, ignore_index: 'bool' = False) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        Pass tuple or list to drop on multiple axes.
        Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values. Cannot be combined with how.
    subset : column label or sequence of labels, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.
    ignore_index : bool, default ``False``
        If ``True``, the resulting axis will be labeled 0, 1, …, n - 1.

        .. versionadded:: 2.0.0

    Returns
    -------
    DataFrame or None
        DataFrame with NA entries dropped from it or None if ``inplace=True``.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'toy'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT